{
  "format": "layers-model",
  "generatedBy": "keras v2.3.1",
  "convertedBy": "TensorFlow.js Converter v1.6.0",
  "modelTopology": {
    "keras_version": "2.3.1",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Model",
      "config": {
        "name": "model_1",
        "layers": [
          {
            "name": "input_1",
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 28, 28],
              "dtype": "float32",
              "sparse": false,
              "name": "input_1"
            },
            "inbound_nodes": []
          },
          {
            "name": "flatten_1",
            "class_name": "Flatten",
            "config": {
              "name": "flatten_1",
              "trainable": true,
              "dtype": "float32",
              "data_format": "channels_last"
            },
            "inbound_nodes": [[["input_1", 0, 0, {}]]]
          },
          {
            "name": "dense_1",
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 200,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["flatten_1", 0, 0, {}]]]
          },
          {
            "name": "dense_2",
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 100,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["dense_1", 0, 0, {}]]]
          },
          {
            "name": "dense_3",
            "class_name": "Dense",
            "config": {
              "name": "dense_3",
              "trainable": true,
              "dtype": "float32",
              "units": 400,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["dense_2", 0, 0, {}]]]
          },
          {
            "name": "dense_4",
            "class_name": "Dense",
            "config": {
              "name": "dense_4",
              "trainable": true,
              "dtype": "float32",
              "units": 100,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["dense_3", 0, 0, {}]]]
          },
          {
            "name": "dense_5",
            "class_name": "Dense",
            "config": {
              "name": "dense_5",
              "trainable": true,
              "dtype": "float32",
              "units": 10,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "VarianceScaling",
                "config": {
                  "scale": 1.0,
                  "mode": "fan_avg",
                  "distribution": "uniform",
                  "seed": null
                }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            },
            "inbound_nodes": [[["dense_4", 0, 0, {}]]]
          }
        ],
        "input_layers": [["input_1", 0, 0]],
        "output_layers": [["dense_5", 0, 0]]
      }
    },
    "training_config": {
      "optimizer_config": {
        "class_name": "Adam",
        "config": {
          "learning_rate": 0.0005000000237487257,
          "beta_1": 0.8999999761581421,
          "beta_2": 0.9990000128746033,
          "decay": 0.0,
          "epsilon": 1e-7,
          "amsgrad": false
        }
      },
      "loss": "categorical_crossentropy",
      "metrics": ["accuracy"],
      "weighted_metrics": null,
      "sample_weight_mode": null,
      "loss_weights": null
    }
  },
  "weightsManifest": [
    {
      "paths": ["group1-shard1of1.bin"],
      "weights": [
        { "name": "dense_1/kernel", "shape": [784, 200], "dtype": "float32" },
        { "name": "dense_1/bias", "shape": [200], "dtype": "float32" },
        { "name": "dense_2/kernel", "shape": [200, 100], "dtype": "float32" },
        { "name": "dense_2/bias", "shape": [100], "dtype": "float32" },
        { "name": "dense_3/kernel", "shape": [100, 400], "dtype": "float32" },
        { "name": "dense_3/bias", "shape": [400], "dtype": "float32" },
        { "name": "dense_4/kernel", "shape": [400, 100], "dtype": "float32" },
        { "name": "dense_4/bias", "shape": [100], "dtype": "float32" },
        { "name": "dense_5/kernel", "shape": [100, 10], "dtype": "float32" },
        { "name": "dense_5/bias", "shape": [10], "dtype": "float32" }
      ]
    }
  ]
}
